Revit 2027 API
Document.PlanTopologies(Phase) Property
Gets the PlanTopologies of the current project in a given phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PlanTopologySet this[
	Phase phase
] { get; }
Public ReadOnly Property PlanTopologies (
	phase As Phase
) As PlanTopologySet
	Get
public:
property PlanTopologySet^ PlanTopologies[Phase^ phase] {
	PlanTopologySet^ get (Phase^ phase);
}
member PlanTopologies : PlanTopologySet with get
Parameters
phase Phase
The phase of the Plan Topology.
Property Value
PlanTopologySet
Remarks
Accessing plan topologies requires that document is modifiable as it will actually trigger calculating plan topologies if they have not been calculated yet. The time necessary for the calculations may be significant and should be considered.
See Also
Reference
Document Class
PlanTopologies Overload
Autodesk.Revit.DB Namespace